Revit 2027 API
FabricationConfiguration.LocateSpecification Method
 Gets the specification identifier by group and name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LocateSpecification(
	string group,
	string name
)
Public Function LocateSpecification (
	group As String,
	name As String
) As Integer
public:
int LocateSpecification(
	String^ group,
	String^ name
)
member LocateSpecification :
        group : string *
        name : string -> int
Parameters
group String
 The specification group.
name String
 The specification name.
Return Value
Int32
 The specification identifier. Returns -1 if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace